# -*- coding: utf-8 -*-

"""
在01-start.py中，方法1的时间复杂度T(n) = O(n * n * n) = O(n*3)
在01-start.py中，方法2的时间复杂度T(n) = O(n * n) = O(n*2)
故方法2的时间复杂度优于方法1
常见时间复杂度:
执行次数函数举例                 阶                 非正式术语
12                                            O(1)                  常数阶
2n+3                                       O(n)                 线行阶
3n**2 + 2n + 1                       O(n**2)           平方阶
5log2n + 20                           O(logn)           对数阶
2n + 3nlog2n + 19                O(nlogn)         nlogn阶
6n**3 + 2n**2 + 3n + 4        O(n**3)            立方阶
2**n                                        O(2**n)            指数阶
"""
